CSI API ETABS v1

# cPropLineSpring Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cPropLineSpring

    Public Interface cPropLineSpring

    Dim instance As cPropLineSpring

    public interface class cPropLineSpring

    type cPropLineSpring =  interface end

The cPropLineSpring type exposes the following members.

Methods

| Name| Description
---|---|---
|
ChangeName|  Changes the name of a
defined line spring property
|
Delete|  Deletes the specified
line spring property
|
GetLineSpringProp|  Retrieves an
existing named line spring property
|
GetNameList|  Retrieves the names
of all defined line spring property
|
SetLineSpringProp|  Creates a new
named line spring property, or modifies an existing named line spring property
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com